Repository: shintadono/Free.Core.Design
Catalog: Properties/Resources.*.resx
Languages: de

# FormatCountInParentheses
source: (Count={0})
de: (Anzahl={0})

# BoolInListDescription
source: This is a boolean value in a list of booleans.
de: Ein Wahrheitswert in einer Liste von Wahrheitswerten.

# NumberInListDescription
source: This is a number in a list of numbers.
de: Eine Zahl in einer Liste von Zahlen.

# StringInListDescription
source: This is a string in a list of strings.
de: Eine Zeichenkette in einer Liste von Zeichenketten.

# ParametersInListDescription
source: This is a Parameters value in a list of Parameters.
de: Ein Parameter (Struktur) in einer Liste von Parametern (Strukturen).

# ParametersInParametersDescription
source: This is a Parameters value in a Parameters.
de: Ein Parameter (Struktur) in einem Parameter (Struktur).

# LongInParametersDescription
source: This is a 64-bit integer value in a Parameters.
de: Eine 64-Bit Ganzzahl in einem Parameter (Struktur).

# DoubleInParametersDescription
source: This is a floating-point value in a Parameters.
de: Eine Fließkommazahl in einem Parameter (Struktur).

# StringInParametersDescription
source: This is a string in a Parameters.
de: Eine Zeichenkette in einem Parameter (Struktur).

# BoolInParametersDescription
source: This is a boolean value in a Parameters.
de: Ein Wahrheitwert in einem Parameter (Struktur).

# ByteArrayInParametersDescription
source: This is an array of bytes in a Parameters.
de: Ein Byte-Feld in einem Parameter (Struktur).

# LongListInParametersDescription
source: This is a list of 64-bit integer values in a Parameters.
de: Eine Liste von 64-Bit Ganzzahlen in einem Parameter (Struktur).

# DoubleListInParametersDescription
source: This is a list of floating-point values in a Parameters.
de: Eine Liste von Fließkommazahlen in einem Parameter (Struktur).

# StringListInParametersDescription
source: This is a list of strings in a Parameters.
de: Eine Liste von Zeichenketten in einem Parameter (Struktur).

# BoolListInParametersDescription
source: This is a list of boolean values in a Parameters.
de: Eine Liste von Wahrheitswerten in einem Parameter (Struktur).

# ParametersListInParametersDescription
source: This is a list of Parameters values in a Parameters.
de: Eine Liste von Parametern (Strukturen) in einem Parameter (Struktur).

# ParametersEditorFormParametersDescription
source: Parameters
de: Parameter

# ParametersEditorFormLongDescription
source: 64-bit integer number
de: 64-Bit Ganzzahl

# ParametersEditorFormDoubleDescription
source: Floating-point number
de: Fließkommazahl

# ParametersEditorFormStringDescription
source: String
de: Zeichenkette

# ParametersEditorFormBoolDescription
source: Boolean
de: Wahrheitswert

# ParametersEditorFormByteArrayDescription
source: Array of bytes
de: Byte-Feld

# ParametersEditorFormLongListDescription
source: List of 64-bit integer numbers
de: Liste von 64-Bit Ganzzahlen

# ParametersEditorFormDoubleListDescription
source: List of floating-point numbers
de: Liste von Fließkommazahlen

# ParametersEditorFormStringListDescription
source: List of strings
de: Liste von Zeichenketten

# ParametersEditorFormBoolListDescription
source: List of booleans
de: Liste von Wahrheitswerten

# ParametersEditorFormParametersListDescription
source: List of Parameters
de: Liste von Parametern (Strukturen)

# ParametersEditorFormParametersDefaultName
source: parameters
de: parameter

# ParametersEditorFormBoolDefaultName
source: boolean
de: wahrheitswert

# ParametersEditorFormLongDefaultName
source: integernumber
de: ganzzahl

# ParametersEditorFormDoubleDefaultName
source: floatingpointnumber
de: kommazahl

# ParametersEditorFormStringDefaultName
source: string
de: zeichenkette

# ParametersEditorFormBoolListDefaultName
source: booleans
de: wahrheitswerte

# ParametersEditorFormLongListDefaultName
source: integernumbers
de: ganzzahlen

# ParametersEditorFormDoubleListDefaultName
source: floatingpointnumbers
de: kommazahlen

# ParametersEditorFormStringListDefaultName
source: strings
de: zeichenketten

# ParametersEditorFormParametersListDefaultName
source: listofParameters
de: parameterliste

# ParametersEditorFormNameInUseErrorMessageBoxText
source: Item with same name already exists in Parameters.
de: Eintrag mit dem gleichen Namen existiert bereit im Parameter (Struktur).

# ParametersEditorFormNameInUseErrorMessageBoxCaption
source: Name already used!
de: Name bereits genutzt!

# ParameterEditorFormListConversionLossOfDataWarningMessageBoxText
source: List contains more than one element. All elements but the first will be lost in conversion of the type. Continue anyway?
de: Liste mit mehr als einen Element. Alle Elemente nach dem ersten werden bei der Typumwandlung verloren gehen. Trotzdem fortsetzen?

# ParameterEditorFormListConversionLossOfDataWarningMessageBoxCaption
source: Loss of data!
de: Verlust von Informationen!

# ByteInArrayDescription
source: This is a byte in an array.
de: Ein Byte in einem Byte-Feld.

# ListEditorFormsPropertiesLabelWithoutText
source: Propertie&s:
de: Eigen&schaften:

# FormatListEditorFormsPropertiesLabelWithText
source: {0} propertie&s:
de: Eigen&schaften von {0}:

# ListEditorFormPropertyGridValueNameText
source: Value
de: Wert

# ListOfParametersEditorGridValueTypeText
source: Parameters
de: Parameter

# ListOfStringEditorGridValueTypeText
source: String
de: Zeichenkette

# ListOfDoubleEditorGridValueTypeText
source: Floating-point Number
de: Fließkommazahl

# ListOfLongEditorGridValueTypeText
source: 64-bit Integer Number
de: 64-Bit Ganzzahl

# TypeInTypedListDescription
source: This is a {0} value in a list of {0} values.
de: Ein {0} Wert in einer Liste von {0} Werten.

# TypeInParametersDescription
source: This is a {0} value in a Parameters.
de: Ein {0} Wert in einem Parameter (Struktur).

# ListOfLongEditorCaption
source: 64-bit Integer Number List Editor
de: Editor für Listen ganzer 64-Bit Zahlen

# ListOfDoubleEditorCaption
source: Floating-point Number List Editor
de: Editor für Listen von Fließkommazahlen

# ListOfStringEditorCaption
source: String List Editor
de: Editor für Listen von Zeichenketten

# ListOfParametersEditorCaption
source: Parameters List Editor
de: Editor für Listen von Parametern (Struktur)
